/**
\file lib.c
\brief Бiблiотечний файл

Цей файл має реализацію функцій lab05 и lab06.
*/
#include<stdio.h>
/**
 Функція lab05.
 \param a - максимальне число в диапазоні
 \param b - мінімальне значення
 
 Послідовність дій

- Створення змінних .

 i - змінна, що використовується при перевірці чисел в установленному диапазоні.

 max - зберігає найбільше просте число.
 
- Викликаємо цикл для перевірки чисел в установленному диапазоні.

- Викликаємо другий цикл для перевірки: число просте чи ні.

- Перевіряємо. Якщо число просте і воно більше максимального, то ми привласнюємо це число змінній max.

*/
int lab05(a, b)
{
   int i, max = 0;
   
   while(a > b)
   {
       b++;
       i = 2;
       while(b%i != 0) 
       {
           i++;
       }
       if(b == i && b > max)
       {
          max = b;      
       }      
   }
   
   return 0;
}

/**
Функція lab06.
\param k - параметр, що зберігає номер квитка.

- Створюємо змінні.
    А - Масив в який записуватимемо щасливі квитки.
    sum1 - сума першої пари чисел.
    sum2 - сума другої пари чисел. 
    n1, n2, n3, n4 - зберігатимуть по одному числу з номера квитка. 
    n – кількість щасливих квитків.
    
    - Запускаемо цикл, що перевіряє усі квитки від k до 9999.
    - Розбиваємо номер квитка на 4 числа.
    - Рахуємо суму першої та другої пари чисел.
    - Перевіряємо, якщо сума першої пари дорівнює сумі другої пари, то записуємо цей білет в массив та додаємо +1 до кіль-ті білетів.
*/
int lab06(k)
{
    int A[9999],sum1,sum2,n1,n2,n3,n4,n=0,i;
    
    while( k<=9999)
    {
        
        n1=k/1000;
        n2=(k/100)%10;
        n3=(k/10)%10;
        n4=k%10;
        
        sum1=n1+n2;
        sum2=n3+n4;
        
        if(sum1==sum2)
        {
          A[n]=k;
          n++;
        }
        
        k++;
    }
    
    return 0;
}
